Ran Plan for 2 projects:

1. project: `k8s-the-hard-way-compute-engine` dir: `k8s-the-hard-way` workspace: `default`
1. project: `k8s-the-hard-way-network` dir: `k8s-the-hard-way-network` workspace: `default`

### 1. project: `k8s-the-hard-way-compute-engine` dir: `k8s-the-hard-way` workspace: `default`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_compute_instance.master[0] will be created
+ resource "google_compute_instance" "master" {
      + can_ip_forward       = true
      + cpu_platform         = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "n1-standard-2"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "kube-master-0"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "kubernetes",
          + "master",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = "asia-southeast1-b"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-1804-lts"
              + labels = (known after apply)
              + size   = 100
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "common"
          + network_ip         = "10.252.100.10"
          + subnetwork         = "kubernetes"
          + subnetwork_project = (known after apply)
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/compute",
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
              + "https://www.googleapis.com/auth/service.management.readonly",
              + "https://www.googleapis.com/auth/servicecontrol",
            ]
        }
    }

  # google_compute_instance.master[1] will be created
+ resource "google_compute_instance" "master" {
      + can_ip_forward       = true
      + cpu_platform         = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "n1-standard-2"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "kube-master-1"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "kubernetes",
          + "master",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = "asia-southeast1-b"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-1804-lts"
              + labels = (known after apply)
              + size   = 100
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "common"
          + network_ip         = "10.252.100.11"
          + subnetwork         = "kubernetes"
          + subnetwork_project = (known after apply)
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/compute",
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
              + "https://www.googleapis.com/auth/service.management.readonly",
              + "https://www.googleapis.com/auth/servicecontrol",
            ]
        }
    }

  # google_compute_instance.master[2] will be created
+ resource "google_compute_instance" "master" {
      + can_ip_forward       = true
      + cpu_platform         = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "n1-standard-2"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "kube-master-2"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "kubernetes",
          + "master",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = "asia-southeast1-b"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-1804-lts"
              + labels = (known after apply)
              + size   = 100
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "common"
          + network_ip         = "10.252.100.12"
          + subnetwork         = "kubernetes"
          + subnetwork_project = (known after apply)
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/compute",
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
              + "https://www.googleapis.com/auth/service.management.readonly",
              + "https://www.googleapis.com/auth/servicecontrol",
            ]
        }
    }

  # google_compute_instance.worker[0] will be created
+ resource "google_compute_instance" "worker" {
      + can_ip_forward       = true
      + cpu_platform         = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "n1-standard-2"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "kube-worker-0"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "kubernetes",
          + "master",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = "asia-southeast1-b"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-1804-lts"
              + labels = (known after apply)
              + size   = 100
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "common"
          + network_ip         = "10.252.100.100"
          + subnetwork         = "kubernetes"
          + subnetwork_project = (known after apply)
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/compute",
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
              + "https://www.googleapis.com/auth/service.management.readonly",
              + "https://www.googleapis.com/auth/servicecontrol",
            ]
        }
    }

  # google_compute_instance.worker[1] will be created
+ resource "google_compute_instance" "worker" {
      + can_ip_forward       = true
      + cpu_platform         = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "n1-standard-2"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "kube-worker-1"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "kubernetes",
          + "master",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = "asia-southeast1-b"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-1804-lts"
              + labels = (known after apply)
              + size   = 100
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "common"
          + network_ip         = "10.252.100.101"
          + subnetwork         = "kubernetes"
          + subnetwork_project = (known after apply)
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/compute",
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
              + "https://www.googleapis.com/auth/service.management.readonly",
              + "https://www.googleapis.com/auth/servicecontrol",
            ]
        }
    }

  # google_compute_instance.worker[2] will be created
+ resource "google_compute_instance" "worker" {
      + can_ip_forward       = true
      + cpu_platform         = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "n1-standard-2"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "kube-worker-2"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "kubernetes",
          + "master",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = "asia-southeast1-b"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-1804-lts"
              + labels = (known after apply)
              + size   = 100
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "common"
          + network_ip         = "10.252.100.102"
          + subnetwork         = "kubernetes"
          + subnetwork_project = (known after apply)
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/compute",
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
              + "https://www.googleapis.com/auth/service.management.readonly",
              + "https://www.googleapis.com/auth/servicecontrol",
            ]
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p k8s-the-hard-way-compute-engine`
* :put_litter_in_its_place: To **delete** this plan click [here](https://62c017ed.ngrok.io/lock?id=ardikabs%252Fatlantica-project%252Fk8s-the-hard-way%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p k8s-the-hard-way-compute-engine`
</details>

---
### 2. project: `k8s-the-hard-way-network` dir: `k8s-the-hard-way-network` workspace: `default`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # google_compute_firewall.external will be created
+ resource "google_compute_firewall" "external" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-common-external"
      + network            = "common"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + source_tags        = [
          + "external",
        ]

      + allow {
          + ports    = [
              + "22",
              + "443",
              + "6443",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.google-health-check will be created
+ resource "google_compute_firewall" "google-health-check" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-common-health-check"
      + network            = "common"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "130.211.0.0/22",
          + "209.85.152.0/22",
          + "209.85.204.0/22",
          + "35.191.0.0/16",
        ]
      + source_tags        = [
          + "google-health-check",
        ]

      + allow {
          + ports    = [
              + "80",
              + "443",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.internal will be created
+ resource "google_compute_firewall" "internal" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-common-internal"
      + network            = "common"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "10.200.0.0/16",
          + "10.252.0.0/16",
        ]
      + source_tags        = [
          + "internal",
        ]

      + allow {
          + ports    = []
          + protocol = "icmp"
        }
      + allow {
          + ports    = []
          + protocol = "tcp"
        }
      + allow {
          + ports    = []
          + protocol = "udp"
        }
    }

  # google_compute_network.vpc will be created
+ resource "google_compute_network" "vpc" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = true
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + ipv4_range                      = (known after apply)
      + name                            = "common"
      + project                         = (known after apply)
      + routing_mode                    = "GLOBAL"
      + self_link                       = (known after apply)
    }

  # google_compute_subnetwork.kubernetes will be created
+ resource "google_compute_subnetwork" "kubernetes" {
      + creation_timestamp = (known after apply)
      + enable_flow_logs   = (known after apply)
      + fingerprint        = (known after apply)
      + gateway_address    = (known after apply)
      + id                 = (known after apply)
      + ip_cidr_range      = "10.252.100.0/24"
      + name               = "kubernetes"
      + network            = (known after apply)
      + project            = (known after apply)
      + region             = "asia-southeast1"
      + secondary_ip_range = (known after apply)
      + self_link          = (known after apply)
    }

  # random_shuffle.az will be destroyed
- resource "random_shuffle" "az" {
      - id           = "-" -> null
      - input        = [
          - "asia-southeast1-a",
          - "asia-southeast1-b",
          - "asia-southeast1-c",
        ] -> null
      - result       = [
          - "asia-southeast1-b",
        ] -> null
      - result_count = 1 -> null
    }

Plan: 5 to add, 0 to change, 1 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "kubernetes" but a value was
found in file "../gcp.tfvars". To use this value, add a "variable" block to
the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.


Warning: Value for undeclared variable

The root module does not declare a variable named "prefix_name" but a value
was found in file "../gcp.tfvars". To use this value, add a "variable" block
to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p k8s-the-hard-way-network`
* :put_litter_in_its_place: To **delete** this plan click [here](https://62c017ed.ngrok.io/lock?id=ardikabs%252Fatlantica-project%252Fk8s-the-hard-way-network%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p k8s-the-hard-way-network`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
